// https://www.nsp.cz/api/v1.2/professionalDirection?limit=10&offset=0
{
  "code": 200,
  "data": [
    {
      "id": 1,
      "title": "Management",
      "urlSlug": "management",
      "level": 1,
      "description": "Management využívá poznatků z matematiky, statistiky, sociologie nebo psychologie, aby prostřednictvím procesu systematického plánování, organizování, rozhodování, vedení a kontroly koordinoval a optimalizoval veškeré zdroje finanční, lidské i další, za účelem dosažení vytyčeného cíle organizace nebo společnosti.",
      "note": "<p>Management využívá poznatků z matematiky, statistiky, sociologie nebo psychologie, aby prostřednictvím procesu systematického plánování, organizování, rozhodování, vedení a kontroly koordinoval a optimalizoval veškeré zdroje finanční, lidské i další, za účelem dosažení vytyčeného cíle organizace nebo společnosti.&nbsp;   </p>",
      "parent": null,
      "legacyId": 1,
      "code": "1"
    },
    {
      "id": 2,
      "title": "Ekonomika, administrativa, personalistika",
      "urlSlug": "ekonomika-administrativa-personalistika",
      "level": 1,
      "description": "Ekonomika zpracovává, analyzuje a vyhodnocuje finanční hospodaření určitého subjektu jako například státu, organizace nebo jednotlivce. Administrativa je souhrn organizačních, provozních kancelářských a pomocných činností, které mají zabezpečit chod určitého týmu, oddělení, útvaru, organizace nebo společnosti. Personalistika se zabývá souborem činností spojených s plánováním, získáváním, výběrem, řízením a rozvojem lidských zdrojů.",
      "note": "<p>Ekonomika zpracovává, analyzuje a vyhodnocuje finanční hospodaření určitého subjektu jako například státu, organizace nebo jednotlivce. </p><p>Administrativa je souhrn organizačních, provozních kancelářských a pomocných činností, které mají zabezpečit chod určitého týmu, oddělení, útvaru, organizace nebo společnosti. </p><p>Personalistika se zabývá souborem činností spojených s plánováním, získáváním, výběrem, řízením a rozvojem lidských zdrojů.&nbsp;</p>",
      "parent": null,
      "legacyId": 2,
      "code": "2"
    },
    {
      "id": 3,
      "title": "Právo",
      "urlSlug": "pravo",
      "level": 1,
      "description": "Právo je soubor obecně závazných pravidel chování, vytvořený a vynutitelný státem, který je zastoupen nezávislými státními orgány. V rámci dodržování stanoveného systému právních norem se vykonávají soudní, exekutorské, notářské a advokátní služby.",
      "note": "<p>Právo je soubor obecně závazných pravidel chování, vytvořený a vynutitelný státem, který je zastoupen nezávislými státními orgány. V rámci dodržování stanoveného systému právních norem se vykonávají soudní, exekutorské, notářské a advokátní služby.   </p>",
      "parent": null,
      "legacyId": 4,
      "code": "4"
    },
    {
      "id": 4,
      "title": "Informační technologie",
      "urlSlug": "informacni-technologie",
      "level": 1,
      "description": "Informační technologie se pomocí technického a programového vybavení zabývají projektováním, konstruováním, programováním, ochranou, uchováváním a vyhledáváním, opravou a údržbou počítačových, databázových a informačních systémů, webových stránek a číslicových zařízení a konfigurací, správou, ochranou, opravou a údržbou počítačových sítí nebo jednotlivých počítačů.",
      "note": "<p>Informační technologie se pomocí technického a programového vybavení zabývají projektováním, konstruováním, programováním, ochranou, uchováváním a vyhledáváním, opravou a údržbou počítačových, databázových a informačních systémů, webových stránek a číslicových zařízení a konfigurací, správou, ochranou, opravou a údržbou počítačových sítí nebo jednotlivých počítačů.   </p>",
      "parent": null,
      "legacyId": 5,
      "code": "5"
    },
    {
      "id": 5,
      "title": "Ochrana majetku, osob a zdraví",
      "urlSlug": "ochrana-majetku-osob-a-zdravi",
      "level": 1,
      "description": "Ochrana majetku, osob a zdraví se zabývá vyhodnocováním bezpečnostních rizik a zajišťováním kybernetické bezpečnosti. Provozuje centrální pulty ochrany a poskytuje služby spojené s ostrahou, ochranou a přepravou nemovitého a movitého majetku, ochranou osob a právních zájmů, při přepravě peněz a cenností či jiného majetku a se zajišťováním pořádku ve veřejných, obchodních a jiných centrech a místech konání veřejných shromáždění, slavností, sportovních podniků nebo lidových zábav.",
      "note": "<p>Ochrana majetku, osob a zdraví se zabývá vyhodnocováním bezpečnostních rizik a zajišťováním kybernetické bezpečnosti. Provozuje centrální pulty ochrany a poskytuje služby spojené s ostrahou, ochranou a přepravou nemovitého a movitého majetku, ochranou osob a právních zájmů, při přepravě peněz a cenností či jiného majetku a se zajišťováním pořádku ve veřejných, obchodních a jiných centrech a místech konání veřejných shromáždění, slavností, sportovních podniků nebo lidových zábav.&nbsp;   </p>",
      "parent": null,
      "legacyId": 6,
      "code": "6"
    },
    {
      "id": 6,
      "title": "Státní správa",
      "urlSlug": "statni-sprava",
      "level": 1,
      "description": "Státní správu vykonávají ústřední a územní orgány státní správy, ostatní státní orgány a jiné k tomu oprávněné subjekty, na které stát výkon státní správy v určitém rozsahu přenesl. Vydávají správní rozhodnutí a upravují postavení a chování občanů, společností a organizací ve vztazích, které vznikají a uskutečňují se v souvislosti s realizací výkonné moci ve státě a ve sféře veřejné správy.",
      "note": "<p>Státní správu vykonávají ústřední a územní orgány státní správy, ostatní státní orgány a jiné k tomu oprávněné subjekty, na které stát výkon státní správy v určitém rozsahu přenesl. Vydávají správní rozhodnutí a upravují postavení a chování občanů, společností a organizací ve vztazích, které vznikají a uskutečňují se v souvislosti s realizací výkonné moci ve státě a ve sféře veřejné správy.   </p>",
      "parent": null,
      "legacyId": 7,
      "code": "7"
    },
    {
      "id": 7,
      "title": "Územně samosprávní celky",
      "urlSlug": "uzemne-samospravni-celky",
      "level": 1,
      "description": "Územně samosprávní celky jsou prostorově vymezené vyšší (kraje) nebo nižší (obce) funkční celky, které vytvářejí vlastní orgány a sami rozhodují o svých záležitostech. V samostatné působnosti vyřizují záležitosti, které nejsou nařízeny státem a vykonávají je pro blaho svých občanů a v přenesené působnosti vyřizují záležitosti, které stanoví zákon a vykonávají je pro své občany v zastoupení státu.",
      "note": "<p>Územně samosprávní celky jsou prostorově vymezené vyšší (kraje) nebo nižší (obce) funkční celky, které vytvářejí vlastní orgány a sami rozhodují o svých záležitostech. V samostatné působnosti vyřizují záležitosti, které nejsou nařízeny státem a vykonávají je pro blaho svých občanů a v přenesené působnosti vyřizují záležitosti, které stanoví zákon a vykonávají je pro své občany v zastoupení státu.&nbsp;   </p>",
      "parent": null,
      "legacyId": 8,
      "code": "8"
    },
    {
      "id": 8,
      "title": "Věda, vzdělávání, sport",
      "urlSlug": "veda-vzdelavani-sport",
      "level": 1,
      "description": "Věda slouží k získávání vědeckých znalostí a poznatků experimentováním, analytickým zkoumáním získaných zkušeností a teoretickým rozborem vzájemného působení zákonitých souvislostí v oblasti technické, lékařské, biologické, veterinární, přírodní, environmentální, společenské nebo humanitní. Vzdělávání umožňuje prostřednictvím vzdělávací a výchovné činnosti nebo odborného výcviku učitele, lektora, instruktora nebo technického prostředku získat, utvářet a prohlubovat soustavu vědomostí, dovedností a znalostí a dosáhnout tak zvýšeného stupně vzdělání, kvalifikace nebo odborné způsobilosti. Sportem označujeme pohybovou (fyzickou) aktivitu provozovanou podle určitých pravidel a zvyklostí, vykonávanou na profesionální nebo zájmové úrovni.",
      "note": "<p>Věda slouží k získávání vědeckých znalostí a poznatků experimentováním, analytickým zkoumáním získaných zkušeností a teoretickým rozborem vzájemného působení zákonitých souvislostí v oblasti technické, lékařské, biologické, veterinární, přírodní, environmentální, společenské nebo humanitní.</p><p>Vzdělávání umožňuje prostřednictvím vzdělávací a výchovné činnosti nebo odborného výcviku učitele, lektora, instruktora nebo technického prostředku získat, utvářet a prohlubovat soustavu vědomostí, dovedností a znalostí a dosáhnout tak zvýšeného stupně vzdělání, kvalifikace nebo odborné způsobilosti.</p><p>Sportem označujeme pohybovou (fyzickou) aktivitu provozovanou podle určitých pravidel a zvyklostí, vykonávanou na profesionální nebo zájmové úrovni.</p>",
      "parent": null,
      "legacyId": 11,
      "code": "11"
    },
    {
      "id": 9,
      "title": "Zdravotnictví a farmacie",
      "urlSlug": "zdravotnictvi-a-farmacie",
      "level": 1,
      "description": "Zdravotnictví poskytuje ambulantní nebo hospitalizační zdravotnickou péči prostřednictvím sítě zdravotnických zařízení a zdravotnické záchranné služby. Zdravotní, ošetřující a pomocný personál ošetřuje nemocné nebo zraněné, léčí symptomy a choroby, ochraňuje duševní a fyzické zdraví a provádí aplikovaný výzkum, vývoj a prevenci onemocnění. Farmacie zabezpečuje výzkum, výrobu, distribuci, skladování a výdej léčivých látek, směsí léčivých látek nebo léčivých přípravků sloužící k příznivému ovlivňování zdraví.",
      "note": "<p>Zdravotnictví poskytuje ambulantní nebo hospitalizační zdravotnickou péči prostřednictvím sítě zdravotnických zařízení a zdravotnické záchranné služby. Zdravotní, ošetřující a pomocný personál ošetřuje nemocné nebo zraněné, léčí symptomy a choroby, ochraňuje duševní a fyzické zdraví a provádí aplikovaný výzkum, vývoj a prevenci onemocnění. </p><p>Farmacie zabezpečuje výzkum, výrobu, distribuci, skladování a výdej léčivých látek, směsí léčivých látek nebo léčivých přípravků sloužící k příznivému ovlivňování zdraví.   </p>",
      "parent": null,
      "legacyId": 12,
      "code": "12"
    },
    {
      "id": 10,
      "title": "Sociální služby",
      "urlSlug": "socialni-sluzby",
      "level": 1,
      "description": "Sociální služby zahrnují prevenci a poradenství, péči a podporu osob v nepříznivé sociální a životní situaci za účelem jejich začlenění do společnosti a ke zlepšení nebo zachování jejich soběstačnosti.",
      "note": "<p>Sociální služby zahrnují prevenci a poradenství, péči a podporu osob v nepříznivé sociální a životní situaci za účelem jejich začlenění do společnosti a ke zlepšení nebo zachování jejich soběstačnosti.   </p><p>Jednotky v sociální oblasti ztrácí s ohledem na aktualizovaný zákon o sociálních službách z roku 2019 svoji platnost, proto byly převedeny do odborného směru Neaktuální jednotky práce pro zachování historie. </p>",
      "parent": null,
      "legacyId": 13,
      "code": "13"
    },
    {
      "id": 11,
      "title": "Doprava a logistika",
      "urlSlug": "doprava-a-logistika",
      "level": 1,
      "description": "Doprava a logistika přemisťuje osoby a zboží na požadované místo a v domluvený čas pomocí dopravních prostředků a dopravní vybavenosti.",
      "note": "<p>Doprava a logistika přemisťuje osoby a zboží na požadované místo a v domluvený čas pomocí dopravních prostředků a dopravní vybavenosti.</p>",
      "parent": null,
      "legacyId": 14,
      "code": "14"
    },
    {
      "id": 12,
      "title": "Poštovní a doručovatelské služby",
      "urlSlug": "postovni-a-dorucovatelske-sluzby",
      "level": 1,
      "description": "Poštovní a doručovatelské služby zahrnují podání, třídění a přepravu poštovních (listovních a balíkových) zásilek a dodání poukázaných peněžních částek prostřednictvím poštovní sítě příjemcům.",
      "note": "<p>Poštovní a doručovatelské služby zahrnují podání, třídění a přepravu poštovních (listovních a balíkových) zásilek a dodání poukázaných peněžních částek prostřednictvím poštovní sítě příjemcům.   </p>",
      "parent": null,
      "legacyId": 15,
      "code": "15"
    },
    {
      "id": 13,
      "title": "Lesní hospodářství",
      "urlSlug": "lesni-hospodarstvi",
      "level": 1,
      "description": "Lesní hospodářství zajišťuje obnovu a výsadbu lesního porostu a činnosti spojené s plánovanou těžbou lesního porostu a nahodilou těžbou po kalamitních situacích.",
      "note": "<p>Lesní hospodářství zajišťuje obnovu a výsadbu lesního porostu a činnosti spojené s plánovanou těžbou lesního porostu a nahodilou těžbou po kalamitních situacích.   </p>",
      "parent": null,
      "legacyId": 16,
      "code": "16"
    },
    {
      "id": 14,
      "title": "Obchod a marketing",
      "urlSlug": "obchod-a-marketing",
      "level": 1,
      "description": "Obchod a marketing propaguje a směňuje zboží nebo služby za peníze či jiná platidla, případně za jiné zboží nebo služby v obchodních provozovnách nebo trzích.",
      "note": "<p>Obchod a marketing propaguje a směňuje zboží nebo služby za peníze či jiná platidla, případně za jiné zboží nebo služby v obchodních provozovnách nebo trzích.   </p>",
      "parent": null,
      "legacyId": 17,
      "code": "17"
    },
    {
      "id": 15,
      "title": "Pohostinství a cestovní ruch",
      "urlSlug": "pohostinstvi-a-cestovni-ruch",
      "level": 1,
      "description": "Pohostinství připravuje a prodává pokrmy a nápoje určené k bezprostřední spotřebě v provozovnách. Cestovní ruch zajišťuje veškeré služby spojené s organizováním, podporováním a poskytováním turistických, poznávacích, rekreačních, lázeňských, sportovních a obchodních pobytů. Wellness poskytuje služby sloužící k duševní, fyzické, sociální a ostatní pohodě člověka prostřednictvím souladu mysli, duše a těla.",
      "note": "<p>Pohostinství připravuje a prodává pokrmy a nápoje určené k bezprostřední spotřebě v provozovnách.</p><p>Cestovní ruch zajišťuje veškeré služby spojené s organizováním, podporováním a poskytováním turistických, poznávacích, rekreačních, lázeňských, sportovních a obchodních pobytů.</p><p><br></p>",
      "parent": null,
      "legacyId": 18,
      "code": "18"
    },
    {
      "id": 16,
      "title": "Bankovnictví, finance a pojišťovnictví",
      "urlSlug": "bankovnictvi-finance-a-pojistovnictvi",
      "level": 1,
      "description": "Bankovnictví se zabývá problematikou financí, spoření, hypoték nebo půjček. Finance zahrnují pohyb peněz a kapitálu mezi různými ekonomickými subjekty a pojišťovnictví je specializovaná oblast finančnictví, která pomáhá zajišťovat veškeré hodnoty včetně zdraví a života, které jsou ohrožovány řadou rizik.",
      "note": "<p>Bankovnictví se zabývá problematikou financí, spoření, hypoték nebo půjček. </p><p>Finance zahrnují pohyb peněz a kapitálu mezi různými ekonomickými subjekty.</p><p>Pojišťovnictví je specializovaná oblast finančnictví, která pomáhá zajišťovat veškeré hodnoty včetně zdraví a života, které jsou ohrožovány řadou rizik.</p>",
      "parent": null,
      "legacyId": 19,
      "code": "19"
    },
    {
      "id": 17,
      "title": "Služby provozní a osobní",
      "urlSlug": "sluzby-provozni-a-osobni",
      "level": 1,
      "description": "Služby provozní a osobní uspokojují kolektivní nebo individuální potřeby zástupců domácností a firem v různých odvětvích, oblastech a životních situacích.",
      "note": "<p>Služby provozní a osobní uspokojují kolektivní nebo individuální potřeby zástupců domácností a firem v různých odvětvích, oblastech a životních situacích.   </p>",
      "parent": null,
      "legacyId": 20,
      "code": "20"
    },
    {
      "id": 18,
      "title": "Umění a kultura",
      "urlSlug": "umeni-a-kultura",
      "level": 1,
      "description": "Umění a kultura vytváří, sdílí a prezentuje estetické předměty, prostředí nebo zážitky prostřednictvím využívání jedinečných tvůrčích dovedností nebo představivosti umělců.",
      "note": "<p>Umění a kultura vytváří, sdílí a prezentuje estetické předměty, prostředí nebo zážitky prostřednictvím využívání jedinečných tvůrčích dovedností nebo představivosti umělců.   </p>",
      "parent": null,
      "legacyId": 21,
      "code": "21"
    },
    {
      "id": 19,
      "title": "Vodní hospodářství",
      "urlSlug": "vodni-hospodarstvi",
      "level": 1,
      "description": "Vodní hospodářství zahrnuje činnosti spojené s chemickou ochranou, využitím, rozvodem a užíváním povrchových a podzemních vod, ochranou a regulací vodních zdrojů a ochranou před škodlivými účinky působení vody.",
      "note": "<p>Vodní hospodářství zahrnuje činnosti spojené s chemickou ochranou, využitím, rozvodem a užíváním povrchových a podzemních vod, ochranou a regulací vodních zdrojů a ochranou před škodlivými účinky působení vody.   </p>",
      "parent": null,
      "legacyId": 22,
      "code": "22"
    },
    {
      "id": 20,
      "title": "Média, publicistika a knihovnictví",
      "urlSlug": "media-publicistika-a-knihovnictvi",
      "level": 1,
      "description": "Média a publicistika se vyjadřují k různým, často aktuálním, tématům, především hospodářským, politickým, sociálním, či kulturním v prostředcích komunikace, tj. v novinách, v televizi, rozhlase, filmu či na Internetu. Knihovnictví shromažďuje, zpracovává, uchovává organizované sbírky knih a dokumentů a poskytuje a zprostředkovává knihovnické a informační služby.",
      "note": "<p>Média a publicistika se vyjadřují k různým, často aktuálním, tématům, především hospodářským, politickým, sociálním, či kulturním v prostředcích komunikace, tj. v novinách, v televizi, rozhlase, filmu či na Internetu. </p><p>Knihovnictví shromažďuje, zpracovává, uchovává organizované sbírky knih a dokumentů a poskytuje a zprostředkovává knihovnické a informační služby.</p>",
      "parent": null,
      "legacyId": 23,
      "code": "23"
    },
    {
      "id": 21,
      "title": "Životní prostředí a nakládání s odpady",
      "urlSlug": "zivotni-prostredi-a-nakladani-s-odpady",
      "level": 1,
      "description": "Životní prostředí tvoří komplexní a propojený systém složený z přírodních, umělých a sociálních složek materiálního světa vytvářející přirozené podmínky existence a vývoje organismů včetně člověka, který poskytuje okolnímu prostředí ochranu nutnou pro uspokojivý život všech organismů na zemi, a to včetně jeho samotného. Nakládání s odpady zahrnuje odvoz, přepravu a odstraňování odpadů spálením nebo uložením na skládku a nejrůznější možné postupy úpravy, kdy se z odpadu stávají suroviny pro další výrobu, jiné výrobky nebo je využit pro výrobu energie.",
      "note": "<p>Životní prostředí tvoří komplexní a propojený systém složený z přírodních, umělých a sociálních složek materiálního světa vytvářející přirozené podmínky existence a vývoje organismů včetně člověka, který poskytuje okolnímu prostředí ochranu nutnou pro uspokojivý život všech organismů na zemi, a to včetně jeho samotného. </p><p>Nakládání s odpady zahrnuje odvoz, přepravu a odstraňování odpadů spálením nebo uložením na skládku a nejrůznější možné postupy úpravy, kdy se z odpadu stávají suroviny pro další výrobu, jiné výrobky nebo je využit pro výrobu energie.&nbsp;   </p>",
      "parent": null,
      "legacyId": 24,
      "code": "24"
    },
    {
      "id": 22,
      "title": "Dřevařská výroba a nábytkářství",
      "urlSlug": "drevarska-vyroba-a-nabytkarstvi",
      "level": 1,
      "description": "Dřevařská výroba z vytěžených a opracovaných kmenů stromů vyrábí dřevěné materiály a polotovary pro použití v dalších průmyslových odvětvích. Nábytkářství vyrábí z přírodních, ale i syntetických materiálů funkční vybavení obytných i neobytných domů a prostorů.",
      "note": "<p>Dřevařská výroba z vytěžených a opracovaných kmenů stromů vyrábí dřevěné materiály a polotovary pro použití v dalších průmyslových odvětvích. </p><p>Nábytkářství vyrábí z přírodních, ale i syntetických materiálů funkční vybavení obytných i neobytných domů a prostorů.</p>",
      "parent": null,
      "legacyId": 25,
      "code": "25"
    },
    {
      "id": 23,
      "title": "Zemědělství a veterinární péče",
      "urlSlug": "zemedelstvi-a-veterinarni-pece",
      "level": 1,
      "description": "Zemědělství prostřednictvím rostlinné a živočišné produkce potravin zajišťuje lidskou výživu. Veterinární péče zahrnuje péči o zdraví zvířat, o zdravotní nezávadnost živočišných produktů a krmiv a ochranu zdraví lidí před jeho poškozením nebo ohrožením živočišnými produkty, ochranu území České republiky před zavlečením nákaz zvířat a nemocí přenosných ze zvířat na člověka.",
      "note": "<p>Zemědělství prostřednictvím rostlinné a živočišné produkce potravin zajišťuje lidskou výživu. </p><p>Veterinární péče zahrnuje péči o zdraví zvířat, o zdravotní nezávadnost živočišných produktů a krmiv a ochranu zdraví lidí před jeho poškozením nebo ohrožením živočišnými produkty, ochranu území České republiky před zavlečením nákaz zvířat a nemocí přenosných ze zvířat na člověka.   </p>",
      "parent": null,
      "legacyId": 26,
      "code": "26"
    },
    {
      "id": 24,
      "title": "Těžba a úprava nerostných surovin",
      "urlSlug": "tezba-a-uprava-nerostnych-surovin",
      "level": 1,
      "description": "Těžba a úprava nerostných surovin zahrnuje povrchovou nebo hlubinnou těžbu a transport fosilních paliv (ropa, zemní plyn), kovových rud (železná ruda, bauxit), nerudních nerostných surovin (uran) a stavebních surovin (kámen, písek, štěrk, vápenec).",
      "note": "<p>Těžba a úprava nerostných surovin zahrnuje povrchovou nebo hlubinnou těžbu a transport fosilních paliv (ropa, zemní plyn), kovových rud (železná ruda, bauxit), nerudních nerostných surovin (uran) a stavebních surovin (kámen, písek, štěrk, vápenec).&nbsp;   </p>",
      "parent": null,
      "legacyId": 27,
      "code": "27"
    },
    {
      "id": 25,
      "title": "Potravinářství a krmivářství",
      "urlSlug": "potravinarstvi-a-krmivarstvi",
      "level": 1,
      "description": "Potravinářství a krmivářství jsou výrobní obory zabývající se zpracováním živočišných anebo rostlinných surovin za účelem výroby nápojů a polotovarů k dalšímu zpracování a výrobou potravin pro obyvatelstvo a krmiv pro zvířata.",
      "note": "<p>Potravinářství a krmivářství jsou výrobní obory zabývající se zpracováním živočišných anebo rostlinných surovin za účelem výroby nápojů a polotovarů k dalšímu zpracování a výrobou potravin pro obyvatelstvo a krmiv pro zvířata.&nbsp;   </p>",
      "parent": null,
      "legacyId": 28,
      "code": "28"
    },
    {
      "id": 26,
      "title": "Textilní a oděvní výroba",
      "urlSlug": "textilni-a-odevni-vyroba",
      "level": 1,
      "description": "Textilní výroba se zabývá zpracováním a využitím rostlinných a syntetických textilních vláken, ze kterých vyrábí materiály pro výrobu oděvů, bytové textilie (koberce, záclony), průmyslové textilie, ochranné pomůcky (rukavice, čepice), lana a další výrobky.\nOděvní výroba v souladu s módními trendy navrhuje a vyrábí oblečení a doplňky.",
      "note": "<p>Textilní výroba se zabývá zpracováním a využitím rostlinných a syntetických textilních vláken, ze kterých vyrábí materiály pro výrobu oděvů, bytové textilie (koberce, záclony), průmyslové textilie, ochranné pomůcky (rukavice, čepice), lana a další výrobky. </p><p>Oděvní výroba v souladu s módními trendy navrhuje a vyrábí oblečení a doplňky.&nbsp;</p>",
      "parent": null,
      "legacyId": 29,
      "code": "29"
    },
    {
      "id": 27,
      "title": "Kožedělná a obuvnická výroba",
      "urlSlug": "kozedelna-a-obuvnicka-vyroba",
      "level": 1,
      "description": "Kožedělná výroba upravuje a zpracovává kůži na usně a na kožešiny, z nichž vyrábí usňové (kožené) a kožešinové zboží v galanterní, brašnářské, sedlářské, rukavičkářské a oděvní výrobě. Obuvnická výroba vyrábí svršky obuvi z přírodních (usňových), syntetických a textilních materiálů a obuv dokončuje nalepením nebo vstřikováním podešví z přírodních nebo syntetických polymerů.",
      "note": "<p>Kožedělná výroba upravuje a zpracovává kůži na usně a na kožešiny, z nichž vyrábí usňové (kožené) a kožešinové zboží v galanterní, brašnářské, sedlářské, rukavičkářské a oděvní výrobě.</p><p>Obuvnická výroba vyrábí svršky obuvi z přírodních (usňových), syntetických a textilních materiálů a obuv dokončuje nalepením nebo vstřikováním podešví z přírodních nebo syntetických polymerů.</p>",
      "parent": null,
      "legacyId": 30,
      "code": "30"
    },
    {
      "id": 28,
      "title": "Umělecká řemesla",
      "urlSlug": "umelecka-remesla",
      "level": 1,
      "description": "Umělecká řemesla za použití ruční práce, tvůrčích dovedností a jedinečných výrobních postupů zhotovují z přírodních či jiných materiálů ojedinělé umělecko-řemeslné výrobky převážně užitné povahy.",
      "note": "<p>Umělecká řemesla za použití ruční práce, tvůrčích dovedností a jedinečných výrobních postupů zhotovují z přírodních či jiných materiálů ojedinělé umělecko-řemeslné výrobky převážně užitné povahy.   </p>",
      "parent": null,
      "legacyId": 31,
      "code": "31"
    },
    {
      "id": 29,
      "title": "Výroba a zpracování papíru",
      "urlSlug": "vyroba-a-zpracovani-papiru",
      "level": 1,
      "description": "Výroba a zpracování papíru používá vlákna ze dřeva nebo jiného rostlinného materiálu pro výrobu celulózy a papíroviny a dalších spotřebních polotovarů a výrobků z papíru.",
      "note": "<p>Výroba a zpracování papíru používá vlákna ze dřeva nebo jiného rostlinného materiálu pro výrobu celulózy a papíroviny a dalších spotřebních polotovarů a výrobků z papíru.   </p>",
      "parent": null,
      "legacyId": 32,
      "code": "32"
    },
    {
      "id": 30,
      "title": "Polygrafie",
      "urlSlug": "polygrafie",
      "level": 1,
      "description": "Polygrafie zahrnuje zpracování textových a obrazových předloh, výrobu tiskových forem, produkční tisk na tiskových strojích a dokončovací zpracování tiskovin prostřednictvím klasických tiskových technik nebo některé z forem digitálního tisku.",
      "note": "<p>Polygrafie zahrnuje zpracování textových a obrazových předloh, výrobu tiskových forem, produkční tisk na tiskových strojích a dokončovací zpracování tiskovin prostřednictvím klasických tiskových technik nebo některé z forem digitálního tisku.   </p>",
      "parent": null,
      "legacyId": 33,
      "code": "33"
    },
    {
      "id": 31,
      "title": "Chemie",
      "urlSlug": "chemie",
      "level": 1,
      "description": "Chemie zahrnuje kromě výroby základních organických i anorganických chemikálií i produkci hnojiv, prostředků na ochranu rostlin, umělých textilních vláken, plastů, pryže, čisticích a mycích prostředků a nátěrových hmot.",
      "note": "<p>Chemie zahrnuje kromě výroby základních organických i anorganických chemikálií i produkci hnojiv, prostředků na ochranu rostlin, umělých textilních vláken, plastů, pryže, čisticích a mycích prostředků a nátěrových hmot.&nbsp;   </p>",
      "parent": null,
      "legacyId": 34,
      "code": "34"
    },
    {
      "id": 32,
      "title": "Sklářská, keramická výroba",
      "urlSlug": "sklarska-keramicka-vyroba",
      "level": 1,
      "description": "Sklářská a keramická výroba zpracovávají silikáty z přírodních zdrojů do nejrůznější užitné a dekorativní podoby skleněných výrobků, skleněných obalů a keramiky. Odvětví navazují na oblast Těžby a úpravy nerostných surovin.",
      "note": "<p>Sklářská a keramická výroba zpracovávají silikáty z přírodních zdrojů do nejrůznější užitné a dekorativní podoby skleněných výrobků, skleněných obalů a keramiky. Odvětví navazují na oblast Těžby a úpravy nerostných surovin.</p>",
      "parent": null,
      "legacyId": 35,
      "code": "35"
    },
    {
      "id": 33,
      "title": "Hutnictví a slévárenství",
      "urlSlug": "hutnictvi-a-slevarenstvi",
      "level": 1,
      "description": "Hutnictví a slévárenství zpracovává železné či neželezné kovové rudy tepelnými procesy a vyrábí polotovary pro další výrobu (ingoty, profily, dráty, odlitky, plechy, výkovky). Na tento směr navazuje oblast Strojírenství a automobilového průmyslu a stavebnictví.",
      "note": "<p>Hutnictví a slévárenství zpracovává železné či neželezné kovové rudy tepelnými procesy a vyrábí polotovary pro další výrobu (ingoty, profily, dráty, odlitky, plechy, výkovky). Na tento směr navazuje oblast Strojírenství a automobilového průmyslu a stavebnictví.&nbsp;   </p>",
      "parent": null,
      "legacyId": 36,
      "code": "36"
    },
    {
      "id": 34,
      "title": "Strojírenství a automobilový průmysl",
      "urlSlug": "strojirenstvi-a-automobilovy-prumysl",
      "level": 1,
      "description": "Strojírenství se zabývá návrhem, výrobou a údržbou strojů a zařízení pro další průmyslová odvětví. \nAutomobilový průmysl vyrábí, montuje a servisuje výrobní a dopravní prostředky a zařízení pro většinu dalších výrobních směrů i pro přímé spotřebitele, za použití kovových součástí i dalších druhů materiálů.",
      "note": "<p>Strojírenství se zabývá návrhem, výrobou a údržbou strojů a zařízení pro další průmyslová odvětví. Automobilový průmysl vyrábí, montuje a servisuje výrobní a dopravní prostředky a zařízení pro většinu dalších výrobních směrů i pro přímé spotřebitele, za použití kovových součástí i dalších druhů materiálů.&nbsp;   </p>",
      "parent": null,
      "legacyId": 37,
      "code": "37"
    },
    {
      "id": 35,
      "title": "Elektrotechnika",
      "urlSlug": "elektrotechnika",
      "level": 1,
      "description": "Elektrotechnika zahrnuje výrobu, montáž, opravy a kontrolu všech slaboproudých i silnoproudých elektrotechnických výrobků a zařízení ve smyslu zapojení a oživení elektrickým proudem.",
      "note": "<p>Elektrotechnika zahrnuje výrobu, montáž, opravy a kontrolu všech slaboproudých i silnoproudých elektrotechnických výrobků a zařízení ve smyslu zapojení a oživení elektrickým proudem.   </p>",
      "parent": null,
      "legacyId": 38,
      "code": "38"
    },
    {
      "id": 36,
      "title": "Elektronické komunikace",
      "urlSlug": "elektronicke-komunikace",
      "level": 1,
      "description": "Elektrotechnické komunikace zajišťují komunikační a datový přenos pomocí soustavy klasických i bezdrátových sítí a zařízení.",
      "note": "<p>Elektrotechnické komunikace zajišťují komunikační a datový přenos pomocí soustavy klasických i bezdrátových sítí a zařízení.   </p>",
      "parent": null,
      "legacyId": 39,
      "code": "39"
    },
    {
      "id": 37,
      "title": "Energetika",
      "urlSlug": "energetika",
      "level": 1,
      "description": "Energetika zahrnuje výstavbu a výrobu energetických zařízení a využívá uhlí, ropu, zemní plyn, jaderné palivo, dřevo, vodu, vítr a geotermální energie pro přeměnu, výrobu a distribuci elektrické energie, tepla a plynu prostřednictvím přenosové soustavy.",
      "note": "<p>Energetika zahrnuje výstavbu a výrobu energetických zařízení a využívá uhlí, ropu, zemní plyn, jaderné palivo, dřevo, vodu, vítr a geotermální energie pro přeměnu, výrobu a distribuci elektrické energie, tepla a plynu prostřednictvím přenosové soustavy.   </p>",
      "parent": null,
      "legacyId": 40,
      "code": "40"
    },
    {
      "id": 38,
      "title": "Stavebnictví a zeměměřictví",
      "urlSlug": "stavebnictvi-a-zememerictvi",
      "level": 1,
      "description": "Stavebnictví a zeměměřictví zajišťuje celý proces související s navrhováním, přípravou a realizací staveb, od architektonického návrhu, výběru vhodných stavebních materiálů a zpracování rozpočtu, rozboru stavebního podloží a vyměření stavby až po samotnou výstavbu, údržbu, modernizaci, rekonstrukci a demolici nejrůznějších typů pozemních, dopravních, vodohospodářských i ekologických staveb.",
      "note": "<p>Stavebnictví a zeměměřictví zajišťuje celý proces související s navrhováním, přípravou a realizací staveb, od architektonického návrhu, výběru vhodných stavebních materiálů a zpracování rozpočtu, rozboru stavebního podloží a vyměření stavby až po samotnou výstavbu, údržbu, modernizaci, rekonstrukci a demolici nejrůznějších typů pozemních, dopravních, vodohospodářských i ekologických staveb.   </p>",
      "parent": null,
      "legacyId": 41,
      "code": "41"
    },
    {
      "id": 39,
      "title": "Povolání bez oboru a mezioborová",
      "urlSlug": "povolani-bez-oboru-a-mezioborova",
      "level": 1,
      "description": "Povolání bez oboru a mezioborová obsahuje všechna povolání, která nelze jednoznačně zařadit do stávajících odborných směrů nebo se jedná o povolání meziodvětvové, které lze naopak zařadit do dvou a více odborných směrů zároveň.",
      "note": "<p>Povolání bez oboru a mezioborová obsahuje všechna povolání, která nelze jednoznačně zařadit do stávajících odborných směrů nebo se jedná o povolání meziodvětvové, které lze naopak zařadit do dvou a více odborných směrů zároveň.   </p>",
      "parent": null,
      "legacyId": 42,
      "code": "42"
    },
    {
      "id": 40,
      "title": "Ozbrojené síly a bezpečnostní sbory",
      "urlSlug": "ozbrojene-sily-a-bezpecnostni-sbory",
      "level": 1,
      "description": null,
      "note": "Ozbrojené síly a bezpečnostní sbory plní obecné a speciální úkoly bezpečnostního charakteru, které vyplývají z bezpečnostní politiky státu, jako je obrana suverenity a územní celistvosti ČR a její bránění před vnějším napadením, ochrana celospolečenských zájmů a hodnot, ochrana právnických a fyzických osob, majetku, životů, zdraví, lidské důstojnosti, plnění a organizování úkolů požární ochrany, civilního nouzového plánování, integrovaného záchranného systému, krizového řízení a dalších.",
      "parent": null,
      "legacyId": 49,
      "code": "3"
    },
    {
      "id": 41,
      "title": "Povolání vyřazená z kategorického třídění pro svoji neaktuálnost",
      "urlSlug": "povolani-vyrazena-z-kategorickeho-trideni-pro-svoji-neaktualnost",
      "level": 1,
      "description": null,
      "note": "Aktuálnost popisu těchto povolání není možné v současné době garantovat z důvodů změny podmínek jejich výkonu od doby, kdy byly vytvořeny, nebo změny legislativy, která se jich týká. Jednotky budou postupně aktualizovány.",
      "parent": null,
      "legacyId": 50,
      "code": "43"
    }
  ],
  "count": 41,
  "message": "OK",
  "_links": {
    "prev": {
      "href": "https://www.nsp.cz/api/v1.2/professionalDirection?limit=100&offset=0"
    },
    "first": {
      "href": "https://www.nsp.cz/api/v1.2/professionalDirection?limit=100&offset=0"
    },
    "last": {
      "href": "https://www.nsp.cz/api/v1.2/professionalDirection?limit=41&offset=0"
    },
    "next": {
      "href": "https://www.nsp.cz/api/v1.2/professionalDirection?limit=41&offset=0"
    },
    "self": {
      "href": "https://www.nsp.cz/api/v1.2/professionalDirection?limit=100&offset=0"
    }
  }
}
